uhnp/src/InformationRegisters/НастройкиИнтеграцииУправлениеПерсоналом/НастройкиИнтеграцииУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииУправлениеПерсоналом</name>
  <resources>
    <name>ВидКИМобильныйТелефон</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ВидКИАдресЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ПубликоватьСтруктуруЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиИнтеграцииУправлениеПерсоналом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииУправлениеПерсоналом.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиИнтеграцииУправлениеПерсоналом);
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ВидКИМобильныйТелефон) Тогда
		СтруктураНастроек.ВидКИМобильныйТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ВидКИАдресЭлектроннойПочты) Тогда
		СтруктураНастроек.ВидКИАдресЭлектроннойПочты = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура СохранитьНовыеВидыКонтактнойИнформации(ВидКИМобильныйТелефон, ВидКИАдресЭлектроннойПочты) Экспорт

	Настройки = Настройки();
	Настройки.ВидКИМобильныйТелефон = ВидКИМобильныйТелефон;
	Настройки.ВидКИАдресЭлектроннойПочты = ВидКИАдресЭлектроннойПочты;
	
	СохранитьНастройки(Настройки);

КонецПроцедуры

Процедура СохранитьНастройкуПубликоватьСтруктуруЮридическихЛиц(НовоеЗначение) Экспорт

	Настройки = Настройки();
	Настройки.ПубликоватьСтруктуруЮридическихЛиц = НовоеЗначение;
	
	СохранитьНастройки(Настройки);

КонецПроцедуры

Процедура СохранитьНастройки(Настройки)
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииУправлениеПерсоналом.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать(); 
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
